MCUdude/MightyCore/avr/boards.txt
###########################################################################################################
## This file is created by MCUdude for use with MightyCore                                               ##
## https://github.com/MCUdude/MightyCore                                                                 ##
##                                                                                                       ##
## This is the file where fuse settings, clock frequencies, upload ports, bootloaders and                ##
## compiler flags are located.                                                                           ##
##                                                                                                       ##
## MighyCore uses the Urboot bootloader, which
###########################################################################################################

# Menu options
menu.clock=Clock
menu.BOD=BOD
menu.eeprom=EEPROM
menu.LTO=Compiler LTO
menu.variant=Variant
menu.pinout=Pinout
menu.bootloader=Bootloader


######################
#### ATmega1284/P ####
######################

# General
1284.name=ATmega1284
1284.upload.tool=avrdude
1284.upload.maximum_data_size=16384
1284.bootloader.tool=avrdude
1284.bootloader.unlock_bits=0xff
1284.bootloader.lock_bits=0xff
1284.bootloader.high_fuses=0b1101{bootloader.eesave_bit}111
1284.build.core=MCUdude_corefiles
1284.build.board=AVR_ATmega1284
1284.build.extra_flags={build.clkpr}

# Upload port select
1284.menu.bootloader.uart0=Yes (UART0)
1284.menu.bootloader.uart0.upload.maximum_size=130560
1284.menu.bootloader.uart0.upload.protocol=urclock
1284.menu.bootloader.uart0.upload.uartpins=uart0_rxd0_txd1
1284.menu.bootloader.uart0.build.export_merged_output=true
1284.menu.bootloader.uart0.bootloader.file=urboot/{build.mcu}/watchdog_1_s/autobaud/{upload.uartpins}/{build.bootloader_led}/urboot_{build.mcu}_pr_ee_ce.hex

1284.menu.bootloader.uart1=Yes (UART1)
1284.menu.bootloader.uart1.upload.maximum_size=130560
1284.menu.bootloader.uart1.upload.protocol=urclock
1284.menu.bootloader.uart1.upload.uartpins=uart1_rxd2_txd3
1284.menu.bootloader.uart1.build.export_merged_output=true
1284.menu.bootloader.uart1.bootloader.file=urboot/{build.mcu}/watchdog_1_s/autobaud/{upload.uartpins}/{build.bootloader_led}/urboot_{build.mcu}_pr_ee_ce.hex

1284.menu.bootloader.no_bootloader=No bootloader
1284.menu.bootloader.no_bootloader.upload.maximum_size=131072
1284.menu.bootloader.no_bootloader.build.export_merged_output=false
1284.menu.bootloader.no_bootloader.bootloader.file=empty/empty.hex

# Pinouts
1284.menu.pinout.standard=Standard pinout
1284.menu.pinout.standard.build.variant=standard
1284.menu.pinout.standard.build.bootloader_led=led+b0
1284.menu.pinout.bobuino=Bobuino pinout
1284.menu.pinout.bobuino.build.variant=bobuino
1284.menu.pinout.bobuino.build.bootloader_led=led+b7
1284.menu.pinout.sanguino=Sanguino pinout
1284.menu.pinout.sanguino.build.variant=sanguino
1284.menu.pinout.sanguino.build.bootloader_led=led+b0

# EEPROM
1284.menu.eeprom.keep=EEPROM retained
1284.menu.eeprom.keep.bootloader.eesave_bit=0
1284.menu.eeprom.erase=EEPROM not retained
1284.menu.eeprom.erase.bootloader.eesave_bit=1

# Variants
1284.menu.variant.modelP=1284P
1284.menu.variant.modelP.build.mcu=atmega1284p
1284.menu.variant.modelNonP=1284
1284.menu.variant.modelNonP.build.mcu=atmega1284

# Brown out detection
1284.menu.BOD.2v7=BOD 2.7V
1284.menu.BOD.2v7.bootloader.extended_fuses=0xfd
1284.menu.BOD.4v3=BOD 4.3V
1284.menu.BOD.4v3.bootloader.extended_fuses=0xfc
1284.menu.BOD.1v8=BOD 1.8V
1284.menu.BOD.1v8.bootloader.extended_fuses=0xfe
1284.menu.BOD.disabled=BOD disabled
1284.menu.BOD.disabled.bootloader.extended_fuses=0xff

# Compiler link time optimization
1284.menu.LTO.Os=LTO disabled
1284.menu.LTO.Os.compiler.c.extra_flags=
1284.menu.LTO.Os.compiler.c.elf.extra_flags=
1284.menu.LTO.Os.compiler.cpp.extra_flags=
1284.menu.LTO.Os.ltoarcmd=avr-ar

1284.menu.LTO.Os_flto=LTO enabled
1284.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
1284.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
1284.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
1284.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

# Clock frequencies
1284.menu.clock.16MHz_external=External 16 MHz
1284.menu.clock.16MHz_external.upload.speed=115200
1284.menu.clock.16MHz_external.bootloader.low_fuses=0xf7
1284.menu.clock.16MHz_external.build.clkpr=
1284.menu.clock.16MHz_external.build.f_cpu=16000000L

1284.menu.clock.20MHz_external=External 20 MHz
1284.menu.clock.20MHz_external.upload.speed=115200
1284.menu.clock.20MHz_external.bootloader.low_fuses=0xf7
1284.menu.clock.20MHz_external.build.clkpr=
1284.menu.clock.20MHz_external.build.f_cpu=20000000L

1284.menu.clock.18_432MHz_external=External 18.4320 MHz
1284.menu.clock.18_432MHz_external.upload.speed=115200
1284.menu.clock.18_432MHz_external.bootloader.low_fuses=0xf7
1284.menu.clock.18_432MHz_external.build.clkpr=
1284.menu.clock.18_432MHz_external.build.f_cpu=18432000L

1284.menu.clock.14_7456MHz_external=External 14.7456 MHz
1284.menu.clock.14_7456MHz_external.upload.speed=115200
1284.menu.clock.14_7456MHz_external.bootloader.low_fuses=0xf7
1284.menu.clock.14_7456MHz_external.build.clkpr=
1284.menu.clock.14_7456MHz_external.build.f_cpu=14745600L

1284.menu.clock.12MHz_external=External 12 MHz
1284.menu.clock.12MHz_external.upload.speed=57600
1284.menu.clock.12MHz_external.bootloader.low_fuses=0xf7
1284.menu.clock.12MHz_external.build.clkpr=
1284.menu.clock.12MHz_external.build.f_cpu=12000000L

1284.menu.clock.11_0592MHz_external=External 11.0592 MHz
1284.menu.clock.11_0592MHz_external.upload.speed=115200
1284.menu.clock.11_0592MHz_external.bootloader.low_fuses=0xf7
1284.menu.clock.11_0592MHz_external.build.clkpr=
1284.menu.clock.11_0592MHz_external.build.f_cpu=11059200L

1284.menu.clock.8MHz_external=External 8 MHz
1284.menu.clock.8MHz_external.upload.speed=57600
1284.menu.clock.8MHz_external.bootloader.low_fuses=0xf7
1284.menu.clock.8MHz_external.build.clkpr=
1284.menu.clock.8MHz_external.build.f_cpu=8000000L

