MCUdude/MightyCore/avr/boards.txt
644.menu.clock.8MHz_external=External 8 MHz
644.menu.clock.8MHz_external.upload.speed=57600
644.menu.clock.8MHz_external.bootloader.low_fuses=0xf7
644.menu.clock.8MHz_external.build.clkpr=
644.menu.clock.8MHz_external.build.f_cpu=8000000L

644.menu.clock.7_3728MHz_external=External 7.3728 MHz
644.menu.clock.7_3728MHz_external.upload.speed=115200
644.menu.clock.7_3728MHz_external.bootloader.low_fuses=0xf7
644.menu.clock.7_3728MHz_external.build.clkpr=
644.menu.clock.7_3728MHz_external.build.f_cpu=7372800L

644.menu.clock.4MHz_external=External 4 MHz
644.menu.clock.4MHz_external.upload.speed=9600
644.menu.clock.4MHz_external.bootloader.low_fuses=0xf7
644.menu.clock.4MHz_external.build.clkpr=
644.menu.clock.4MHz_external.build.f_cpu=4000000L

644.menu.clock.3_6864MHz_external=External 3.6864 MHz
644.menu.clock.3_6864MHz_external.upload.speed=115200
644.menu.clock.3_6864MHz_external.bootloader.low_fuses=0xf7
644.menu.clock.3_6864MHz_external.build.clkpr=
644.menu.clock.3_6864MHz_external.build.f_cpu=3686400L

644.menu.clock.2MHz_external=External 2 MHz
644.menu.clock.2MHz_external.upload.speed=9600
644.menu.clock.2MHz_external.bootloader.low_fuses=0xf7
644.menu.clock.2MHz_external.build.clkpr=
644.menu.clock.2MHz_external.build.f_cpu=2000000L

644.menu.clock.1_8432MHz_external=External 1.8432 MHz
644.menu.clock.1_8432MHz_external.upload.speed=115200
644.menu.clock.1_8432MHz_external.bootloader.low_fuses=0xf7
644.menu.clock.1_8432MHz_external.build.clkpr=
644.menu.clock.1_8432MHz_external.build.f_cpu=1843200L

644.menu.clock.1MHz_external=External 1 MHz
644.menu.clock.1MHz_external.upload.speed=9600
644.menu.clock.1MHz_external.bootloader.low_fuses=0xf7
644.menu.clock.1MHz_external.build.clkpr=
644.menu.clock.1MHz_external.build.f_cpu=1000000L

644.menu.clock.8MHz_internal=Internal 8 MHz
644.menu.clock.8MHz_internal.upload.speed=38400
644.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
644.menu.clock.8MHz_internal.build.clkpr=
644.menu.clock.8MHz_internal.build.f_cpu=8000000L

644.menu.clock.4MHz_internal=Internal 4 MHz
644.menu.clock.4MHz_internal.upload.speed=9600
644.menu.clock.4MHz_internal.bootloader.low_fuses=0xe2
644.menu.clock.4MHz_internal.build.clkpr=-DOSC_PRESCALER=0x01
644.menu.clock.4MHz_internal.build.f_cpu=4000000L

644.menu.clock.2MHz_internal=Internal 2 MHz
644.menu.clock.2MHz_internal.upload.speed=9600
644.menu.clock.2MHz_internal.bootloader.low_fuses=0xe2
644.menu.clock.2MHz_internal.build.clkpr=-DOSC_PRESCALER=0x02
644.menu.clock.2MHz_internal.build.f_cpu=2000000L

644.menu.clock.1MHz_internal=Internal 1 MHz
644.menu.clock.1MHz_internal.upload.speed=9600
644.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
644.menu.clock.1MHz_internal.build.clkpr=
644.menu.clock.1MHz_internal.build.f_cpu=1000000L



##########################
#### ATmega324A/P/PA  ####
##########################

# General
324.name=ATmega324
324.upload.tool=avrdude
324.upload.maximum_data_size=2048
324.bootloader.tool=avrdude
324.bootloader.unlock_bits=0xff
324.bootloader.lock_bits=0xff
324.bootloader.high_fuses=0b1101{bootloader.eesave_bit}111
324.build.core=MCUdude_corefiles
324.build.board=AVR_ATmega324
324.build.extra_flags={build.clkpr}

# Upload port select
324.menu.bootloader.uart0=Yes (UART0)
324.menu.bootloader.uart0.upload.maximum_size=32384
324.menu.bootloader.uart0.upload.protocol=urclock
324.menu.bootloader.uart0.upload.uartpins=uart0_rxd0_txd1
324.menu.bootloader.uart0.build.export_merged_output=true
324.menu.bootloader.uart0.bootloader.file=urboot/{build.mcu}/watchdog_1_s/autobaud/{upload.uartpins}/{build.bootloader_led}/urboot_{build.mcu}_pr_ee_ce.hex

324.menu.bootloader.uart1=Yes (UART1)
324.menu.bootloader.uart1.upload.maximum_size=32384
324.menu.bootloader.uart1.upload.protocol=urclock
324.menu.bootloader.uart1.upload.uartpins=uart1_rxd2_txd3
324.menu.bootloader.uart1.build.export_merged_output=true
324.menu.bootloader.uart1.bootloader.file=urboot/{build.mcu}/watchdog_1_s/autobaud/{upload.uartpins}/{build.bootloader_led}/urboot_{build.mcu}_pr_ee_ce.hex

324.menu.bootloader.uart2=Yes (UART2 324PB only)
324.menu.bootloader.uart2.upload.maximum_size=32384
324.menu.bootloader.uart2.upload.protocol=urclock
324.menu.bootloader.uart2.upload.uartpins=uart2_rxe2_txe3
324.menu.bootloader.uart2.build.export_merged_output=true
324.menu.bootloader.uart2.bootloader.file=urboot/{build.mcu}/watchdog_1_s/autobaud/{upload.uartpins}/{build.bootloader_led}/urboot_{build.mcu}_pr_ee_ce.hex

324.menu.bootloader.no_bootloader=No bootloader
324.menu.bootloader.no_bootloader.upload.maximum_size=32768
324.menu.bootloader.no_bootloader.build.export_merged_output=false
324.menu.bootloader.no_bootloader.bootloader.file=empty/empty.hex

# EEPROM
324.menu.eeprom.keep=EEPROM retained
324.menu.eeprom.keep.bootloader.eesave_bit=0
324.menu.eeprom.erase=EEPROM not retained
324.menu.eeprom.erase.bootloader.eesave_bit=1

# Pinouts
324.menu.pinout.standard=Standard pinout
324.menu.pinout.standard.build.variant=standard
324.menu.pinout.standard.build.bootloader_led=led+b0
324.menu.pinout.bobuino=Bobuino pinout
324.menu.pinout.bobuino.build.variant=bobuino
324.menu.pinout.bobuino.build.bootloader_led=led+b7
324.menu.pinout.sanguino=Sanguino pinout
324.menu.pinout.sanguino.build.variant=sanguino
324.menu.pinout.sanguino.build.bootloader_led=led+b0

# Variants
324.menu.variant.modelP=324P
324.menu.variant.modelP.bootloader.cksel_bits=0111
324.menu.variant.modelP.bootloader.cfd_bit=1
324.menu.variant.modelP.build.mcu=atmega324p
324.menu.variant.modelPA=324PA
324.menu.variant.modelPA.bootloader.cksel_bits=0111
324.menu.variant.modelPA.bootloader.cfd_bit=1
324.menu.variant.modelPA.build.mcu=atmega324pa
324.menu.variant.modelA=324A
324.menu.variant.modelA.bootloader.cksel_bits=0111
324.menu.variant.modelA.bootloader.cfd_bit=1
324.menu.variant.modelA.build.mcu=atmega324a
324.menu.variant.modelPB=324PB
324.menu.variant.modelPB.bootloader.cksel_bits=1111
324.menu.variant.modelPB.bootloader.cfd_bit=0
324.menu.variant.modelPB.build.mcu=atmega324pb

# Brown out detection
324.menu.BOD.2v7=BOD 2.7V
324.menu.BOD.2v7.bootloader.extended_fuses=0b1111{bootloader.cfd_bit}101
324.menu.BOD.4v3=BOD 4.3V
324.menu.BOD.4v3.bootloader.extended_fuses=0b1111{bootloader.cfd_bit}100
324.menu.BOD.1v8=BOD 1.8V
324.menu.BOD.1v8.bootloader.extended_fuses=0b1111{bootloader.cfd_bit}110
324.menu.BOD.disabled=BOD disabled
324.menu.BOD.disabled.bootloader.extended_fuses=0b1111{bootloader.cfd_bit}111

# Compiler link time optimization
324.menu.LTO.Os=LTO disabled
324.menu.LTO.Os.compiler.c.extra_flags=
324.menu.LTO.Os.compiler.c.elf.extra_flags=
324.menu.LTO.Os.compiler.cpp.extra_flags=
324.menu.LTO.Os.ltoarcmd=avr-ar

