MCUdude/MightyCore/avr/boards.txt
324.menu.LTO.Os_flto=LTO enabled
324.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
324.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
324.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
324.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

# Clock frequencies
324.menu.clock.16MHz_external=External 16 MHz
324.menu.clock.16MHz_external.upload.speed=115200
324.menu.clock.16MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
324.menu.clock.16MHz_external.build.clkpr=
324.menu.clock.16MHz_external.build.f_cpu=16000000L

324.menu.clock.20MHz_external=External 20 MHz
324.menu.clock.20MHz_external.upload.speed=115200
324.menu.clock.20MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
324.menu.clock.20MHz_external.build.clkpr=
324.menu.clock.20MHz_external.build.f_cpu=20000000L

324.menu.clock.18_432MHz_external=External 18.4320 MHz
324.menu.clock.18_432MHz_external.upload.speed=115200
324.menu.clock.18_432MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
324.menu.clock.18_432MHz_external.build.clkpr=
324.menu.clock.18_432MHz_external.build.f_cpu=18432000L

324.menu.clock.14_7456MHz_external=External 14.7456 MHz
324.menu.clock.14_7456MHz_external.upload.speed=115200
324.menu.clock.14_7456MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
324.menu.clock.14_7456MHz_external.build.clkpr=
324.menu.clock.14_7456MHz_external.build.f_cpu=14745600L

324.menu.clock.12MHz_external=External 12 MHz
324.menu.clock.12MHz_external.upload.speed=57600
324.menu.clock.12MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
324.menu.clock.12MHz_external.build.clkpr=
324.menu.clock.12MHz_external.build.f_cpu=12000000L

324.menu.clock.11_0592MHz_external=External 11.0592 MHz
324.menu.clock.11_0592MHz_external.upload.speed=115200
324.menu.clock.11_0592MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
324.menu.clock.11_0592MHz_external.build.clkpr=
324.menu.clock.11_0592MHz_external.build.f_cpu=11059200L

324.menu.clock.8MHz_external=External 8 MHz
324.menu.clock.8MHz_external.upload.speed=57600
324.menu.clock.8MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
324.menu.clock.8MHz_external.build.clkpr=
324.menu.clock.8MHz_external.build.f_cpu=8000000L

324.menu.clock.7_3728MHz_external=External 7.3728 MHz
324.menu.clock.7_3728MHz_external.upload.speed=115200
324.menu.clock.7_3728MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
324.menu.clock.7_3728MHz_external.build.clkpr=
324.menu.clock.7_3728MHz_external.build.f_cpu=7372800L

324.menu.clock.4MHz_external=External 4 MHz
324.menu.clock.4MHz_external.upload.speed=9600
324.menu.clock.4MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
324.menu.clock.4MHz_external.build.clkpr=
324.menu.clock.4MHz_external.build.f_cpu=4000000L

324.menu.clock.3_6864MHz_external=External 3.6864 MHz
324.menu.clock.3_6864MHz_external.upload.speed=115200
324.menu.clock.3_6864MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
324.menu.clock.3_6864MHz_external.build.clkpr=
324.menu.clock.3_6864MHz_external.build.f_cpu=3686400L

324.menu.clock.2MHz_external=External 2 MHz
324.menu.clock.2MHz_external.upload.speed=9600
324.menu.clock.2MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
324.menu.clock.2MHz_external.build.clkpr=
324.menu.clock.2MHz_external.build.f_cpu=2000000L

324.menu.clock.1_8432MHz_external=External 1.8432 MHz
324.menu.clock.1_8432MHz_external.upload.speed=115200
324.menu.clock.1_8432MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
324.menu.clock.1_8432MHz_external.build.clkpr=
324.menu.clock.1_8432MHz_external.build.f_cpu=1843200L

324.menu.clock.1MHz_external=External 1 MHz
324.menu.clock.1MHz_external.upload.speed=9600
324.menu.clock.1MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
324.menu.clock.1MHz_external.build.clkpr=
324.menu.clock.1MHz_external.build.f_cpu=1000000L

324.menu.clock.8MHz_internal=Internal 8 MHz
324.menu.clock.8MHz_internal.upload.speed=38400
324.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
324.menu.clock.8MHz_internal.build.clkpr=
324.menu.clock.8MHz_internal.build.f_cpu=8000000L

324.menu.clock.4MHz_internal=Internal 4 MHz
324.menu.clock.4MHz_internal.upload.speed=9600
324.menu.clock.4MHz_internal.bootloader.low_fuses=0xe2
324.menu.clock.4MHz_internal.build.clkpr=-DOSC_PRESCALER=0x01
324.menu.clock.4MHz_internal.build.f_cpu=4000000L

324.menu.clock.2MHz_internal=Internal 2 MHz
324.menu.clock.2MHz_internal.upload.speed=9600
324.menu.clock.2MHz_internal.bootloader.low_fuses=0xe2
324.menu.clock.2MHz_internal.build.clkpr=-DOSC_PRESCALER=0x02
324.menu.clock.2MHz_internal.build.f_cpu=2000000L

324.menu.clock.1MHz_internal=Internal 1 MHz
324.menu.clock.1MHz_internal.upload.speed=9600
324.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
324.menu.clock.1MHz_internal.build.clkpr=
324.menu.clock.1MHz_internal.build.f_cpu=1000000L



##########################
#### ATmega164A/P/PA  ####
##########################

# General
164.name=ATmega164
164.upload.tool=avrdude
164.upload.maximum_data_size=1024
164.bootloader.tool=avrdude
164.bootloader.unlock_bits=0xff
164.bootloader.lock_bits=0xff
164.bootloader.high_fuses=0b1101{bootloader.eesave_bit}101
164.build.core=MCUdude_corefiles
164.build.board=AVR_ATmega164
164.build.extra_flags={build.clkpr}

# Upload port select
164.menu.bootloader.uart0=Yes (UART0)
164.menu.bootloader.uart0.upload.maximum_size=16000
164.menu.bootloader.uart0.upload.protocol=urclock
164.menu.bootloader.uart0.upload.uartpins=uart0_rxd0_txd1
164.menu.bootloader.uart0.build.export_merged_output=true
164.menu.bootloader.uart0.bootloader.file=urboot/{build.mcu}/watchdog_1_s/autobaud/{upload.uartpins}/{build.bootloader_led}/urboot_{build.mcu}_pr_ee_ce.hex

164.menu.bootloader.uart1=Yes (UART1)
164.menu.bootloader.uart1.upload.maximum_size=16000
164.menu.bootloader.uart1.upload.protocol=urclock
164.menu.bootloader.uart1.upload.uartpins=uart1_rxd2_txd3
164.menu.bootloader.uart1.build.export_merged_output=true
164.menu.bootloader.uart1.bootloader.file=urboot/{build.mcu}/watchdog_1_s/autobaud/{upload.uartpins}/{build.bootloader_led}/urboot_{build.mcu}_pr_ee_ce.hex

164.menu.bootloader.no_bootloader=No bootloader
164.menu.bootloader.no_bootloader.upload.maximum_size=16384
164.menu.bootloader.no_bootloader.build.export_merged_output=false
164.menu.bootloader.no_bootloader.bootloader.file=empty/empty.hex

# EEPROM
164.menu.eeprom.keep=EEPROM retained
164.menu.eeprom.keep.bootloader.eesave_bit=0
164.menu.eeprom.erase=EEPROM not retained
164.menu.eeprom.erase.bootloader.eesave_bit=1

# Pinouts
164.menu.pinout.standard=Standard pinout
164.menu.pinout.standard.build.variant=standard
164.menu.pinout.standard.build.bootloader_led=led+b0
164.menu.pinout.bobuino=Bobuino pinout
164.menu.pinout.bobuino.build.variant=bobuino
164.menu.pinout.bobuino.build.bootloader_led=led+b7
164.menu.pinout.sanguino=Sanguino pinout
164.menu.pinout.sanguino.build.variant=sanguino
164.menu.pinout.sanguino.build.bootloader_led=led+b0

