MCUdude/MightyCore/avr/boards.txt
# Brown out detection - This is the first part of the low fuse bit concatenation
8535.menu.BOD.2v7=BOD 2.7V
8535.menu.BOD.2v7.bootloader.bod_bits=10
8535.menu.BOD.4v0=BOD 4.0V
8535.menu.BOD.4v0.bootloader.bod_bits=00
8535.menu.BOD.disabled=BOD disabled
8535.menu.BOD.disabled.bootloader.bod_bits=11

# Compiler link time optimization
8535.menu.LTO.Os=LTO disabled
8535.menu.LTO.Os.compiler.c.extra_flags=
8535.menu.LTO.Os.compiler.c.elf.extra_flags=
8535.menu.LTO.Os.compiler.cpp.extra_flags=
8535.menu.LTO.Os.ltoarcmd=avr-ar

8535.menu.LTO.Os_flto=LTO enabled
8535.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
8535.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
8535.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
8535.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

# Clock frequencies - This is the second part of the low fuse bit concatenation
8535.menu.clock.16MHz_external=External 16 MHz
8535.menu.clock.16MHz_external.upload.speed=115200
8535.menu.clock.16MHz_external.bootloader.sut_cksel_bits=111111
8535.menu.clock.16MHz_external.bootloader.ckopt_bit=0
8535.menu.clock.16MHz_external.build.f_cpu=16000000L

8535.menu.clock.20MHz_external=External 20 MHz
8535.menu.clock.20MHz_external.upload.speed=115200
8535.menu.clock.20MHz_external.bootloader.sut_cksel_bits=111111
8535.menu.clock.20MHz_external.bootloader.ckopt_bit=0
8535.menu.clock.20MHz_external.build.f_cpu=20000000L

8535.menu.clock.18_432MHz_external=External 18.4320 MHz
8535.menu.clock.18_432MHz_external.upload.speed=115200
8535.menu.clock.18_432MHz_external.bootloader.sut_cksel_bits=111111
8535.menu.clock.18_432MHz_external.bootloader.ckopt_bit=0
8535.menu.clock.18_432MHz_external.build.f_cpu=18432000L

8535.menu.clock.14_7456MHz_external=External 14.7456 MHz
8535.menu.clock.14_7456MHz_external.upload.speed=115200
8535.menu.clock.14_7456MHz_external.bootloader.sut_cksel_bits=111111
8535.menu.clock.14_7456MHz_external.bootloader.ckopt_bit=0
8535.menu.clock.14_7456MHz_external.build.f_cpu=14745600L

8535.menu.clock.12MHz_external=External 12 MHz
8535.menu.clock.12MHz_external.upload.speed=57600
8535.menu.clock.12MHz_external.bootloader.sut_cksel_bits=111111
8535.menu.clock.12MHz_external.bootloader.ckopt_bit=0
8535.menu.clock.12MHz_external.build.f_cpu=12000000L

8535.menu.clock.11_0592MHz_external=External 11.0592 MHz
8535.menu.clock.11_0592MHz_external.upload.speed=115200
8535.menu.clock.11_0592MHz_external.bootloader.sut_cksel_bits=111111
8535.menu.clock.11_0592MHz_external.bootloader.ckopt_bit=0
8535.menu.clock.11_0592MHz_external.build.f_cpu=11059200L

8535.menu.clock.8MHz_external=External 8 MHz
8535.menu.clock.8MHz_external.upload.speed=57600
8535.menu.clock.8MHz_external.bootloader.sut_cksel_bits=111111
8535.menu.clock.8MHz_external.bootloader.ckopt_bit=0
8535.menu.clock.8MHz_external.build.f_cpu=8000000L

8535.menu.clock.7_3728MHz_external=External 7.3728 MHz
8535.menu.clock.7_3728MHz_external.upload.speed=115200
8535.menu.clock.7_3728MHz_external.bootloader.sut_cksel_bits=111111
8535.menu.clock.7_3728MHz_external.bootloader.ckopt_bit=0
8535.menu.clock.7_3728MHz_external.build.f_cpu=7372800L

8535.menu.clock.4MHz_external=External 4 MHz
8535.menu.clock.4MHz_external.upload.speed=9600
8535.menu.clock.4MHz_external.bootloader.sut_cksel_bits=111111
8535.menu.clock.4MHz_external.bootloader.ckopt_bit=0
8535.menu.clock.4MHz_external.build.f_cpu=4000000L

8535.menu.clock.3_6864MHz_external=External 3.6864 MHz
8535.menu.clock.3_6864MHz_external.upload.speed=115200
8535.menu.clock.3_6864MHz_external.bootloader.sut_cksel_bits=111111
8535.menu.clock.3_6864MHz_external.bootloader.ckopt_bit=0
8535.menu.clock.3_6864MHz_external.build.f_cpu=3686400L

8535.menu.clock.2MHz_external=External 2 MHz
8535.menu.clock.2MHz_external.upload.speed=9600
8535.menu.clock.2MHz_external.bootloader.sut_cksel_bits=111111
8535.menu.clock.2MHz_external.bootloader.ckopt_bit=0
8535.menu.clock.2MHz_external.build.f_cpu=2000000L

8535.menu.clock.1_8432MHz_external=External 1.8432 MHz
8535.menu.clock.1_8432MHz_external.upload.speed=115200
8535.menu.clock.1_8432MHz_external.bootloader.sut_cksel_bits=111111
8535.menu.clock.1_8432MHz_external.bootloader.ckopt_bit=0
8535.menu.clock.1_8432MHz_external.build.f_cpu=1843200L

8535.menu.clock.1MHz_external=External 1 MHz
8535.menu.clock.1MHz_external.upload.speed=9600
8535.menu.clock.1MHz_external.bootloader.sut_cksel_bits=111111
8535.menu.clock.1MHz_external.bootloader.ckopt_bit=0
8535.menu.clock.1MHz_external.build.f_cpu=1000000L

8535.menu.clock.8MHz_internal=Internal 8 MHz
8535.menu.clock.8MHz_internal.upload.speed=38400
8535.menu.clock.8MHz_internal.bootloader.sut_cksel_bits=100100
8535.menu.clock.8MHz_internal.bootloader.ckopt_bit=1
8535.menu.clock.8MHz_internal.build.f_cpu=8000000L

8535.menu.clock.4MHz_internal=Internal 4 MHz
8535.menu.clock.4MHz_internal.upload.speed=9600
8535.menu.clock.4MHz_internal.bootloader.sut_cksel_bits=100001
8535.menu.clock.4MHz_internal.bootloader.ckopt_bit=1
8535.menu.clock.4MHz_internal.build.f_cpu=4000000L

8535.menu.clock.2MHz_internal=Internal 2 MHz
8535.menu.clock.2MHz_internal.upload.speed=9600
8535.menu.clock.2MHz_internal.bootloader.sut_cksel_bits=100001
8535.menu.clock.2MHz_internal.bootloader.ckopt_bit=1
8535.menu.clock.2MHz_internal.build.f_cpu=2000000L

8535.menu.clock.1MHz_internal=Internal 1 MHz
8535.menu.clock.1MHz_internal.upload.speed=9600
8535.menu.clock.1MHz_internal.bootloader.sut_cksel_bits=100001
8535.menu.clock.1MHz_internal.bootloader.ckopt_bit=1
8535.menu.clock.1MHz_internal.build.f_cpu=1000000L
